# ShowFooterTitle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleSortGroupField..::..ShowFooterTitle Property
ScheduleSortGroupField Class See Also
---
Indicates if the footer row should display a title.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool ShowFooterTitle { get; set; }
```

Visual Basic
---
```text
Public Property ShowFooterTitle As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowFooterTitle {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
True if a title should be displayed, false otherwise.
# Remarks
The title consists of the value of the field that the schedule is grouped by.
ShowFooterTitle can only be enabled if ShowFooter is enabled.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: Display of footer rows is not enabled. |

# See Also
ScheduleSortGroupField Class
Autodesk.Revit.DB Namespace